# IsAutomatic Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheetSet..::..IsAutomatic Property
ViewSheetSet Class See Also
---
Automatic order or manual order.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool IsAutomatic { get; set; }
```

Visual Basic
---
```text
Public Overridable Property IsAutomatic As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
virtual property bool IsAutomatic {
	bool get ();
	void set (bool value);
}
```

# ### Implements
IViewSheetSet..::..IsAutomatic
# See Also
ViewSheetSet Class
Autodesk.Revit.DB Namespace